In [3]:
import pandas as pd

In [4]:
#pd.__version__

In [26]:
dataframe = pd.read_csv(r'/Users/alanmartinezblanco/Documents/Codigo Curso Python/documentosPandas/dataframeutf8.csv')

In [27]:
dataframe

  Nombre y apellido  Edad       País Automovil Vivienda
0              Juan    35     Mexico        No       Si
1             Pedro    41   Honduras        Si       No
2             Maria    28       Peru        Si       Si
3             Laura    66  Argentina        No       No
4             Laura    66  Argentina        No       No
5            Alvaro    33       Peru        Si       No
6              Alan    29     Mexico        Si       Si
7             Magda    29     Mexico        No       Si

# Value counts

In [ ]:
# value_counts te cuenta los valores repetidos en las columnas
dataframe.Edad.value_counts()

In [15]:
dataframe.Automovil.value_counts()

No    2
Si    2
Name: Automovil, dtype: int64

In [17]:
dataframe.País.value_counts()

Mexico       1
Honduras     1
Peru         1
Argentina    1
Name: País, dtype: int64

# sort values

In [28]:
#sort value, ordena la informacion
dataframe.sort_values(by=["Edad"])

  Nombre y apellido  Edad       País Automovil Vivienda
2             Maria    28       Peru        Si       Si
6              Alan    29     Mexico        Si       Si
7             Magda    29     Mexico        No       Si
5            Alvaro    33       Peru        Si       No
0              Juan    35     Mexico        No       Si
1             Pedro    41   Honduras        Si       No
3             Laura    66  Argentina        No       No
4             Laura    66  Argentina        No       No

# Filter values

In [29]:
#filtrado de valores
dataframe[dataframe.País=="Mexico"]

  Nombre y apellido  Edad    País Automovil Vivienda
0              Juan    35  Mexico        No       Si
6              Alan    29  Mexico        Si       Si
7             Magda    29  Mexico        No       Si

In [31]:
dataframe[(dataframe.País=="Peru") & (dataframe.Automovil =="Si")]

  Nombre y apellido  Edad  País Automovil Vivienda
2             Maria    28  Peru        Si       Si
5            Alvaro    33  Peru        Si       No

# contains and starts with

In [34]:
dataframe[dataframe.País.str.contains('Mex')]

  Nombre y apellido  Edad    País Automovil Vivienda
0              Juan    35  Mexico        No       Si
6              Alan    29  Mexico        Si       Si
7             Magda    29  Mexico        No       Si

In [37]:
dataframe[dataframe.País.str.startswith('M')]

  Nombre y apellido  Edad    País Automovil Vivienda
0              Juan    35  Mexico        No       Si
6              Alan    29  Mexico        Si       Si
7             Magda    29  Mexico        No       Si

# Modificar indices

In [48]:
dataframe.set_index('País', inplace=True)

In [49]:
dataframe

          Nombre y apellido  Edad Automovil Vivienda
País
Mexico                 Juan    35        No       Si
Honduras              Pedro    41        Si       No
Peru                  Maria    28        Si       Si
Argentina             Laura    66        No       No
Argentina             Laura    66        No       No
Peru                 Alvaro    33        Si       No
Mexico                 Alan    29        Si       Si
Mexico                Magda    29        No       Si

In [52]:
dataframe.sort_index(inplace=True)

In [53]:
dataframe

          Nombre y apellido  Edad Automovil Vivienda
País
Argentina             Laura    66        No       No
Argentina             Laura    66        No       No
Honduras              Pedro    41        Si       No
Mexico                 Juan    35        No       Si
Mexico                 Alan    29        Si       Si
Mexico                Magda    29        No       Si
Peru                  Maria    28        Si       Si
Peru                 Alvaro    33        Si       No

In [57]:
dataframe.reset_index(inplace=True)

In [62]:
dataframe

        País Nombre y apellido  Edad Automovil Vivienda
0  Argentina             Laura    66        No       No
1  Argentina             Laura    66        No       No
2   Honduras             Pedro    41        Si       No
3     Mexico              Juan    35        No       Si
4     Mexico              Alan    29        Si       Si
5     Mexico             Magda    29        No       Si
6       Peru             Maria    28        Si       Si
7       Peru            Alvaro    33        Si       No

# localizar por indice, funciona solo con indice definido

In [58]:
dataframe.loc[dataframe.País =='Peru']

   País Nombre y apellido  Edad Automovil Vivienda
6  Peru             Maria    28        Si       Si
7  Peru            Alvaro    33        Si       No

# filtrado-

In [63]:
filtrar = dataframe[((dataframe.País == "Mexico")| (dataframe.País =="Argentina")) & (dataframe.Automovil == 'Si')]

In [64]:
print(filtrar)

     País Nombre y apellido  Edad Automovil Vivienda
4  Mexico              Alan    29        Si       Si

In [65]:
filtrar = dataframe[((dataframe.País == "Mexico")| (dataframe.País =="Argentina"))]

In [66]:
filtrar

        País Nombre y apellido  Edad Automovil Vivienda
0  Argentina             Laura    66        No       No
1  Argentina             Laura    66        No       No
3     Mexico              Juan    35        No       Si
4     Mexico              Alan    29        Si       Si
5     Mexico             Magda    29        No       Si

In [67]:
agrupar = filtrar.groupby(['País', 'Automovil']).size()

In [68]:
agrupar

País       Automovil
Argentina  No           2
Mexico     No           2
           Si           1
dtype: int64

In [70]:
unstack = agrupar.unstack('Automovil')
unstack

Automovil   No   Si
País
Argentina  2.0  NaN
Mexico     2.0  1.0